In [20]:
# Importación de librerias necesarias para la transformacion y limpieza de datos
# ---------------------------------------------------------------------------------
# Tratamiento de datos
import pandas as pd
import numpy as np

#Gestion de archivos y rutas
import os
import sys

# Visualizacion de datos
import matplotlib.pyplot as plt
import seaborn as sns

# Configuracion de Pandas y eliminacion de warnings
pd.set_option('display.max_columns', None)  # Mostrar todas las columnas en los DataFrames
import warnings
warnings.filterwarnings("ignore")  # Ocultar warnings innecesarios

# Funciones de extraccion y exploracion de datos
# Obtener la ruta del directorio raiz del proyecto
ruta_proyecto = os.path.abspath(os.path.join(os.getcwd(), ".."))
# Agregar src/ al path si no esta ya incluido
if ruta_proyecto not in sys.path:
    sys.path.append(ruta_proyecto)
    
# Importar modulos de src   
from src import eda
from src import variables as va

In [21]:
# Importacion datos
df = eda.extraer_datos_csv("../datos/bruto/Bank_Customer_Churn_Prediction.csv")

✅ Datos extraidos correctamente. Filas: 10000, Columnas: 12

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [22]:
# Renombrar columnas 
df.rename(columns=va.columnas_renombradas, inplace=True)
display(df.head())

,id_cliente,puntacion_credito,pais,genero,edad,antiguedad,saldo,num_productos,tarjeta_credito,miembro_activo,salario_estimado,abandono
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [23]:
# Transformación binaria
def transformar_binarios(df, columnas):
    """
    Convierte valores binarios (1 y 0) a 'Si' y 'No' respectivamente en las columnas especificadas.

    Parametros:
        df (pd.DataFrame): DataFrame con los datos.
        columnas (list): Lista de columnas a transformar.

    Retorna:
        pd.DataFrame: DataFrame con valores transformados.
    """
    for col in columnas:
        # Verificar si la columna tiene valores binarios antes de aplicar la transformacion
        if df[col].isin([0, 1]).all():
            df[col] = df[col].map(va.mapeo_binario)
    return df

## TEST FUNCIONES ✨

In [29]:
df = transformar_binarios(df, va.columnas_binarias)
display(df[va.columnas_binarias].head())

  tarjeta_credito miembro_activo abandono
0              Si             Si       Si
1              No             Si       No
2              Si             No       Si
3              No             No       No
4              Si             Si       No